[
  {
    "idiom": "a moot point",
    "definition": "A subject which gives rise to argument or debate."
  },
  {
    "idiom": "nothing doing",
    "definition": "This term means that there is no way you would accept to do what is proposed."
  },
  {
    "idiom": "at odds",
    "definition": "To disagree with someone."
  },
  {
    "idiom": "olive branch",
    "definition": "To show that someone wants to end a disagreement and make peace."
  },
  {
    "idiom": "out of the question",
    "definition": "To be impossible and is therefore not worth discussing."
  },
  {
    "idiom": "over someone's dead body",
    "definition": "This expression is used by someone who absolutely refuses to allow someone to do something."
  },
  {
    "idiom": "pick a fight",
    "definition": "To deliberately look for an opportunity to start a quarrel or begin an argument."
  },
  {
    "idiom": "pick holes",
    "definition": "To criticize something or try to find fault with it."
  },
  {
    "idiom": "press something home",
    "definition": "To insist on a point in a discussion or argument."
  },
  {
    "idiom": "running battle",
    "definition": "To argue or disagree about something over a long period of time."
  },
  {
    "idiom": "send someone packing",
    "definition": "To tell someone to leave, in a very forceful and unfriendly way."
  },
  {
    "idiom": "shouting match",
    "definition": "An argument or debate where people shout loudly at each other."
  },
  {
    "idiom": "sink someone's differences",
    "definition": "To decide to forget disagreements."
  },
  {
    "idiom": "sit on the fence",
    "definition": "To avoid taking sides in a discussion or argument."
  },
  {
    "idiom": "skating on thin ice",
    "definition": "To do or say something that could cause disagreement or trouble."
  },
  {
    "idiom": "split hairs",
    "definition": "To pay too much attention to differences that are very small or unimportant."
  },
  {
    "idiom": "water under the bridge",
    "definition": "If something difficult or unpleasant took place in the past but is no longer important."
  },
  {
    "idiom": "wipe the slate clean",
    "definition": "To make a fresh start and forget all past offences, disagreements or mistakes."
  },
  {
    "idiom": "cat and dog life",
    "definition": "A life in which partners are constantly or frequently quarrelling."
  },
  {
    "idiom": "caught in the crossfire",
    "definition": "To suffer the effects of an argument or dispute between two people or groups."
  },
  {
    "idiom": "clear the air",
    "definition": "To try to remove the causes of fear, worry or suspicion by talking about the problem openly."
  },
  {
    "idiom": "dead set against",
    "definition": "To be strongly opposed to something."
  },
  {
    "idiom": "devil's advocate",
    "definition": "To pretend to be against an idea or plan in order to determine the validity of the arguments in favour of it."
  },
  {
    "idiom": "fight like cat and dog",
    "definition": "Two people who fight or argue frequently have violent arguments, even though they are fond of each other."
  },
  {
    "idiom": "go against the tide/stream",
    "definition": "To refuse to conform to current trends, or the opinions or behaviour of other people."
  },
  {
    "idiom": "hammer and tongs",
    "definition": "To argue fiercely, with a lot of energy and noise."
  },
  {
    "idiom": "let bygones be bygones",
    "definition": "To decide to forget about past disagreements."
  }
]
